nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [1.0, 1.0, 3072] 

# LeYOLO Nano backbone
backbone:
  # [from, repeats, module, args]
  #(self, c2, k=3, e=None, stride=1, pw=True)
  - [-1, 1, conv_ln, [96, 4, 4]]                   #P2  0
  - [-1, 1, ConvNext_block, [96, 384]]             #P2  1
  - [-1, 1, ConvNext_block, [96, 384, 0.005]]      #P2  2
  - [-1, 1, ConvNext_block, [96, 384, 0.01176]] #P2  3
  
  - [-1, 1, ln_conv, [192, 2, 2]]              #P3  4
  - [-1, 1, ConvNext_block, [192, 768, 0.01176]] #P3  5
  - [-1, 1, ConvNext_block, [192, 768, 0.01764]] #P3  6
  - [-1, 1, ConvNext_block, [192, 768, 0.02352]] #P3  7
  - [-1, 1, ConvNext_block, [192, 768, 0.0294]] #P3  8
  
  - [-1, 1, ln_conv, [384, 2, 2]]              #P4  9
  - [-1, 1, ConvNext_block, [384, 1536, 0.03529]] #P4  10
  - [-1, 1, ConvNext_block, [384, 1536, 0.0411764]] #P4  11
  - [-1, 1, ConvNext_block, [384, 1536, 0.0470588]] #P4  12
  - [-1, 1, ConvNext_block, [384, 1536, 0.0529411]] #P4  13
  - [-1, 1, ConvNext_block, [384, 1536, 0.058235]] #P4  14
  - [-1, 1, ConvNext_block, [384, 1536, 0.06470]] #P4  15
  - [-1, 1, ConvNext_block, [384, 1536, 0.0705882]] #P4  16
  - [-1, 1, ConvNext_block, [384, 1536, 0.07647058]] #P4  17
  - [-1, 1, ConvNext_block, [384, 1536, 0.082352]] #P4  18
  
  - [-1, 1, ln_conv, [768, 2, 2]]              #P5  19
  - [-1, 1, ConvNext_block, [768, 3072, 0.08823]] #P5  20
  - [-1, 1, ConvNext_block, [768, 3072, 0.09411]] #P5  21
  - [-1, 1, ConvNext_block, [768, 3072, 0.1]] #P5  22
  
  - [-1, 1, SPPF, [96, 5]]                               #    23
  
# LeYOLO Nano head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                #24
  - [[-1, 18], 1, Concat, [1]]  # cat backbone P4             #25
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #26
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #27
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #28

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 256, True, "SI", 1, False]]
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]]    #33

  - [-1, 1, mn_conv, [64, 3, 2, "SI"]]
  - [[-1, 28], 1, Concat, [1]]  # cat head P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #38

  - [-1, 1, mn_conv, [96, 3, 2, "SI"]]
  - [[-1, 23], 1, Concat, [1]]  # cat head P5
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]]   #43

  - [[32, 38, 43], 1, Detect, [nc]]  # Detect(P3, P4, P5)
