nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [1.0, 1.0, 576] 

# LeYOLO Nano backbone
backbone:
  # [from, repeats, module, args]
  #(self, c2, k=3, e=None, stride=1, pw=True)
  - [-1, 1, mn_conv, [32, 3, 2, "SI"]]                   #P1  0
  - [-1, 1, efficient_det, [16, 3, 32, 1, False]]        #P1  1
  - [-1, 1, efficient_det, [24, 3, 96, 2]]               #P2  2
  - [-1, 1, efficient_det, [24, 3, 144, 1]]              #P2  3
  - [-1, 1, efficient_det, [40, 5, 144, 2]]              #P3  4
  - [-1, 1, efficient_det, [40, 5, 240, 1]]              #P3  5
  - [-1, 1, efficient_det, [80, 3, 240, 2]]              #P4  6
  - [-1, 1, efficient_det, [80, 3, 480, 1]]              #P4  7 
  - [-1, 1, efficient_det, [80, 3, 480, 1]]              #P4  8
  - [-1, 1, efficient_det, [112, 5, 144, 1]]             #P4  9
  - [-1, 1, efficient_det, [112, 5, 672, 1]]             #P4  10
  - [-1, 1, efficient_det, [112, 5, 672, 1]]             #P4  11
  - [-1, 1, efficient_det, [192, 5, 672, 2]]             #P5  12
  - [-1, 1, efficient_det, [192, 5, 1152, 1]]            #P5  13
  - [-1, 1, efficient_det, [192, 5, 1152, 1]]            #P5  14
  - [-1, 1, efficient_det, [192, 3, 1152, 1]]            #P5  15
  - [-1, 1, SPPF, [96, 5]]                               #    16
  
# LeYOLO Nano head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                #17
  - [[-1, 11], 1, Concat, [1]]  # cat backbone P4             #18
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #19
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #20
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #21

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 104, True, "SI", 1, False]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]]    #26

  - [-1, 1, mn_conv, [64, 3, 2, "SI"]]
  - [[-1, 21], 1, Concat, [1]]  # cat head P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #31

  - [-1, 1, mn_conv, [96, 3, 2, "SI"]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P5
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]]   #36

  - [[26, 31, 36], 1, Detect, [nc]]  # Detect(P3, P4, P5)
