nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [1.0, 1.0, 576] 

# LeYOLO Nano backbone
backbone:
  # [from, repeats, module, args]
  #(self, c2, k=3, e=None, stride=1, pw=True)
  - [-1, 1, mn_conv, [32, 3, 2, "RE"]]                   #P1  0
  - [-1, 1, classic_mobilenet_v3, [16, 3, 32, 1, False, "RE", False]]        #P1  1
  
  - [-1, 1, classic_mobilenet_v3, [24, 3, 96, 2, False, "RE"]]        #P2  2
  - [-1, 1, classic_mobilenet_v3, [24, 3, 144, 1, False, "RE"]]        #P2  3
  
  - [-1, 1, classic_mobilenet_v3, [32, 3, 144, 2, False, "RE"]]        #P3  4
  - [-1, 1, classic_mobilenet_v3, [32, 3, 192, 1, False, "RE"]]        #P3  5
  - [-1, 1, classic_mobilenet_v3, [32, 3, 192, 1, False, "RE"]]        #P3  6
  
  - [-1, 1, classic_mobilenet_v3, [64, 3, 192, 2, False, "RE"]]        #P4  7
  - [-1, 1, classic_mobilenet_v3, [64, 3, 384, 1, False, "RE"]]        #P4  8
  - [-1, 1, classic_mobilenet_v3, [64, 3, 384, 1, False, "RE"]]        #P4  9
  - [-1, 1, classic_mobilenet_v3, [64, 3, 384, 1, False, "RE"]]        #P4  10
  - [-1, 1, classic_mobilenet_v3, [96, 3, 384, 1, False, "RE"]]        #P4  11
  - [-1, 1, classic_mobilenet_v3, [96, 3, 576, 1, False, "RE"]]        #P4  12
  - [-1, 1, classic_mobilenet_v3, [96, 3, 576, 1, False, "RE"]]        #P4  13
  
  - [-1, 1, classic_mobilenet_v3, [160, 3, 576, 2, False, "RE"]]        #P5  14
  - [-1, 1, classic_mobilenet_v3, [160, 3, 960, 1, False, "RE"]]        #P5  15
  - [-1, 1, classic_mobilenet_v3, [160, 3, 960, 1, False, "RE"]]        #P5  16
  - [-1, 1, classic_mobilenet_v3, [320, 3, 960, 1, False, "RE"]]        #P5  17
  
  - [-1, 1, SPPF, [96, 5]]                               #    18
  
# LeYOLO Nano head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                #19
  - [[-1, 13], 1, Concat, [1]]  # cat backbone P4             #20
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #21
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #22
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #23

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 96, True, "SI", 1, False]]
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]]    #28

  - [-1, 1, mn_conv, [64, 3, 2, "SI"]]
  - [[-1, 23], 1, Concat, [1]]  # cat head P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #33

  - [-1, 1, mn_conv, [96, 3, 2, "SI"]]
  - [[-1, 18], 1, Concat, [1]]  # cat head P5
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]]   #38

  - [[28, 33, 38], 1, Detect, [nc]]  # Detect(P3, P4, P5)
