nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  n: [1.0, 1.0, 576] 

# LeYOLO Nano backbone
backbone:
  # [from, repeats, module, args]
  #(self, c2, k=3, e=None, stride=1, pw=True)
  - [-1, 1, mn_conv, [16, 3, 2, "RE"]]                   #P1  0
  - [-1, 1, classic_mobilenet_v3, [5, 3, 16, 1, False, "RE", False]]        #P1  1
  
  - [-1, 1, classic_mobilenet_v3, [8, 3, 15, 2, False, "RE"]]        #P2  2
  - [-1, 1, classic_mobilenet_v3, [8, 3, 22, 1, False, "RE"]]        #P2  3
  - [-1, 1, classic_mobilenet_v3, [8, 3, 2, 1, False, "RE"]]        #P2  4
  
  - [-1, 1, classic_mobilenet_v3, [12, 5, 36, 2, False, "RE"]]        #P3  5
  - [-1, 1, classic_mobilenet_v3, [12, 5, 36, 1, False, "RE"]]        #P3  6
  - [-1, 1, classic_mobilenet_v3, [12, 5, 36, 1, False, "RE"]]        #P3  7
  
  - [-1, 1, classic_mobilenet_v3, [24, 5, 72, 2, False, "RE"]]        #P4  8
  - [-1, 1, classic_mobilenet_v3, [24, 5, 144, 1, False, "RE"]]        #P4  9
  - [-1, 1, classic_mobilenet_v3, [24, 5, 144, 1, False, "RE"]]        #P4  10
  - [-1, 1, classic_mobilenet_v3, [29, 3, 144, 1, False, "RE"]]        #P4  11
  - [-1, 1, classic_mobilenet_v3, [29, 3, 172, 1, False, "RE"]]        #P4  12
  
  - [-1, 1, classic_mobilenet_v3, [58, 5, 346, 2, False, "RE"]]        #P5  13
  - [-1, 1, classic_mobilenet_v3, [58, 5, 346, 1, False, "RE"]]        #P5  14
  - [-1, 1, classic_mobilenet_v3, [58, 5, 346, 1, False, "RE"]]        #P5  15
  - [-1, 1, classic_mobilenet_v3, [96, 3, 346, 1, False, "RE"]]        #P5  16
  
  - [-1, 1, SPPF, [96, 5]]                               #    17
  
# LeYOLO Nano head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                #18
  - [[-1, 12], 1, Concat, [1]]  # cat backbone P4             #19
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #20
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #21
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #22

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 76, True, "SI", 1, False]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [32, 3, 64, True, "SI", 1]]    #27

  - [-1, 1, mn_conv, [64, 3, 2, "SI"]]
  - [[-1, 22], 1, Concat, [1]]  # cat head P4
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [64, 5, 128, True, "SI", 1]]   #32

  - [-1, 1, mn_conv, [96, 3, 2, "SI"]]
  - [[-1, 17], 1, Concat, [1]]  # cat head P5
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]] 
  - [-1, 1, MobileNetV3_BLOCK, [96, 5, 192, True, "SI", 1]]   #37

  - [[27, 32, 37], 1, Detect, [nc]]  # Detect(P3, P4, P5)
